#include "Define.h"
#include "DBError.h"

static const char szDBErr[][32] =
{
	"无错误",

	"初始化数据库连接失败",
	"数据操作层内部异常",
	"启动事务处理失败",
	"提交事务处理失败",
	"SQL语句参数错误",

	"读取本地文件数据失败",
	"写入本地文件数据失败",
	"创建本地文件失败",
	"打开本地文件失败",
	"本地文件数据CRC错误",

	"创建帐号失败",
	"未找到此帐号用户",
	"帐号ID与帐号名称不匹配",
	"帐号ID已存在但帐号名不存在",
	"帐号名称存在但帐号ID不存在",
	"帐号元宝扣值失败",

	"角色数据不能转换到最新版本",
	"角色数据转换参数不合法",
	"角色数据转换失败",
	"角色结构版本定义不正确",
	"未找到指定角色数据",
	"玩家离线数据解压错误",
	"玩家离线数据压缩错误",
	"二进制数据过大",
	"二进制数据长度无法确定",
	"角色名已经被使用",
	"角色数据太多(超过5个)",
	"无法分配角色ID",
	"创建角色数据失败",
	"恢复删除角色失败",

	"更新邮件数据失败",
	"收件人不存在",
	"收件人名称不存在",
	"邮件数量达到上限",
	"未找到此邮件数据",

	"更新包裹栏物品数据失败",
	"更新装备栏物品数据失败",
	"更新银行仓库栏物品数据失败",

	"更新增益BUFF数据失败",
	"更新减益BUFF数据失败",
	"更新系统BUFF数据失败",
	"更新调度BUFF数据失败",

	"更新冷却时间表数据失败",
	"更新声望数据失败",
	"更新生活技能数据失败",
	"更新配方数据失败",

	"更新任务数据错误",
	"更新任务旗标数据错误",

	"更新灵兽数据失败",
	"更新骑宠数据失败",

	"更新快捷栏数据失败",
	"更新物品分解栏数据失败",
	"更新物品合成栏数据失败",

	"更新技能栏数据失败",
	"更新社会关系数据失败",
	"更新元神数据失败",

	"更新赠送物品计时器失败",
	"更新宠物修行计时器失败",

	"更新活动及任务时效数据失败",
	"保存出师数据失败",
	"保存系统逻辑事件失败",
	"保存地图公共配置失败",

	"家族族长已经存在",
	"家族名已经存在",
	"解散家族操作失败",
	"排行榜异兽blob数据未查找到",
	"排行榜奇珍blob数据未查找到",

	"联盟盟主已经存在",
	"联盟名称已经存在",
	"解散家族操作失败",

	"元宝交易挂单预扣元宝失败",
	"元宝挂单撤消返回元宝失败",
	"元宝挂单已撤消",

	"元宝兑换数据查询未果",
	"元宝兑换配置数据查询未果",
	"领取元宝兑换失败",

	"拍卖行商品查询未果",
	"物主不能对自己商品购买",
	"购买价格不匹配",

	"未知的错误",
};

const char* getDBErr(DBError e)
{
	if(e >= DBERR_MAX)
		return "";
	return szDBErr[e];
}
